Repository: Ael-urus/Sensorem
Catalog: Sensorem/core/locale/*/LC_messages/messages.po
Languages: fr

source: Sensorem - Sensor Signal Processing
fr: Sensorem - Traitement des signaux des capteurs

source: Processing
fr: Traitement

source: Database
fr: Base de données

source: Welcome to the Database tab
fr: Bienvenue dans l'onglet Base de données

source: Error
fr: Erreur

source: No file selected in the list
fr: Aucun fichier sélectionné dans la liste

source: Processing file: {}
fr: Traitement du fichier : {}

source: Error processing file: {}
fr: Erreur lors du traitement du fichier : {}

source: File selected: {}
fr: Fichier sélectionné : {}

source: Event triggered: selection
fr: Événement déclenché : sélection

source: Checking selected file
fr: Vérification du fichier sélectionné

source: Trigram validated: {}
fr: Trigrame validé : {}

source: Sensors validated successfully: {}
fr: Capteurs validés avec succès : {}

source: Units validated: Sensor: {}, Ref: {}, Ref Name: {}
fr: Unités validées : Capteur : {}, Réf : {}, Nom Réf : {}

source: Coefficients validated: a={}, b={}
fr: Coefficients validés : a={}, b={}

source: Coefficients validated: {}, {}
fr: Coefficients validés : {}, {}

source: Returning to previous selection: index={}
fr: Retour à la sélection précédente : index={}

source: Selection event completed
fr: Événement de sélection terminé

source: No file selected for processing
fr: Aucun fichier sélectionné pour le traitement

source: Initializing listbox selection
fr: Initialisation de la sélection de la liste

source: No files to select
fr: Aucun fichier à sélectionner

source: Restoring selection: index={}
fr: Restauration de la sélection : index={}

source: Selection restored to index {}
fr: Sélection restaurée à l'index {}

source: Trigram
fr: Trigrame

source: Name (Trigram):
fr: Nom (Trigrame) :

source: Validate
fr: Valider

source: Sensors
fr: Capteurs

source: Sensor Name:
fr: Nom du capteur :

source: Start Line:
fr: Ligne de début :

source: Add Sensor
fr: Ajouter un capteur

source: Validate Sensors
fr: Valider les capteurs

source: Delete
fr: Supprimer

source: Units
fr: Unités

source: Unit (Ref Sensor):
fr: Unité (Capteur Réf) :

source: Unit (Sensor):
fr: Unité (Capteur) :

source: Name (Ref Sensor):
fr: Nom (Capteur Réf) :

source: Validate Units
fr: Valider les unités

source: Coefficients
fr: Coéfficients

source: Validate Coefficients
fr: Valider les coefficients

source: Invalid coefficients.
fr: Coefficients invalides.

source: Reference Sensor Conversion Coefficients
fr: Coefficients de conversion du capteur de référence

source: Graphs
fr: Graphiques

source: Graph 2 Placeholder
fr: Espace réservé au graphique 2

source: Graph 1 Placeholder
fr: Espace réservé au graphique 1

source: Start line '{}' must be a number.
fr: La ligne de début '{}' doit être un nombre.

source: Start line must be a number
fr: La ligne de début doit être un nombre

source: All sensors must have a name and start line.
fr: Tous les capteurs doivent avoir un nom et une ligne de début.

source: Sensor name '{}' is invalid.
fr: Le nom du capteur '{}' est invalide.

source: Coefficients must be valid numbers.
fr: Les coefficients doivent être des nombres valides.

source: Coefficients must be numbers
fr: Les coefficients doivent être des nombres

source: Units and reference name must be provided.
fr: Les unités et le nom de référence doivent être fournis.

source: Coefficient a cannot be zero.
fr: Le coefficient a ne peut pas être zéro.

source: Restoration blocked: _processing_selection is True
fr: Restauration bloquée : _processing_selection est True

source: No Selection
fr: Aucune sélection

source: Please select a file from the list.
fr: Veuillez sélectionner un fichier dans la liste.

source: Validation Error
fr: Erreur de validation

source: Event blocked: _processing_selection is True
fr: Événement bloqué : _processing_selection est True

source: No CSV files found in directory: {}
fr: Aucun fichier CSV trouvé dans le répertoire : {}

source: File loaded successfully: {}
fr: Fichier chargé avec succès : {}

source: File selected successfully: {}
fr: Fichier sélectionné avec succès : {}

source: No selection to restore or invalid index
fr: Aucune sélection à restaurer ou index invalide

source: English
fr: Anglais

source: File not found: {}
fr: Fichier introuvable : {}

source: Logs
fr: Journaux

source: No file selected
fr: Aucun fichier sélectionné

source: No file selected for loading
fr: Aucun fichier sélectionné pour le chargement

source: All unit fields must be non-empty
fr: Tous les champs d'unité doivent être remplis

source: All validations passed. PDF generation enabled.
fr: Toutes les validations ont réussi. Génération de PDF activée.

source: Available Files:
fr: Fichiers disponibles :

source: Clear Logs
fr: Effacer les journaux

source: Directory not found: {}
fr: Répertoire introuvable : {}

source: Error listing CSV files: {}
fr: Erreur lors de la liste des fichiers CSV : {}

source: Error selecting file: {}
fr: Erreur lors de la sélection du fichier : {}

source: Files and Processing
fr: Fichiers et Traitement

source: Found {} CSV files in {}
fr: {} fichiers CSV trouvés dans {}

source: Invalid coefficients: {}, {}
fr: Coefficients invalides : {}, {}

source: Invalid sensors format
fr: Format des capteurs invalide

source: Invalid start line for sensor {}: {}
fr: Ligne de début invalide pour le capteur {} : {}

source: Invalid trigram: {}
fr: Trigrame invalide : {}

source: Invalid units or reference name
fr: Unités ou nom de référence invalides

source: Language changed to {}
fr: Langue changée en {}

source: Previous selected index is no longer valid.
fr: L'index précédemment sélectionné n'est plus valide.

source: Processing Output:
fr: Résultat du traitement :

source: Quit
fr: Quitter

source: Sensors validated: {}
fr: Capteurs validés : {}

source: Units and reference name must be non-empty strings
fr: Les unités et le nom de référence doivent être des chaînes non vides

source: Units validated: {}, {}, {}
fr: Unités validées : {}, {}, {}

source: Unsupported language: {}
fr: Langue non prise en charge : {}

source: Validations pending. PDF generation disabled.
fr: Validations en attente. Génération de PDF désactivée.

source: Error loading file: {}
fr: Erreur lors du chargement du fichier : {}

source: Trigram must be exactly 3 letters
fr: Le trigrame doit comporter exactement 3 lettres

source: Trigram must be exactly 3 letters.
fr: Le trigrame doit comporter exactement 3 lettres.

source: Invalid sensor configuration.
fr: Configuration des capteurs invalide.

source: Sensor name and start line must be non-empty and start line must be a number
fr: Le nom du capteur et la ligne de début ne doivent pas être vides, et la ligne de début doit être un nombre

source: string
fr: chaîne de caractères

source: context", "string
fr: contexte", "chaîne

source: Logs erased
fr: Journaux effacés

source: LogsTab refreshed
fr: Onglet Logs rafraichi

source: Trigram successfully validated : {}
fr: Trigramme validé : {}

source: Trigram validation Error
fr: Erreur de la validation du trigramme

source: Trigram validation Error : {}
fr: Erreur de la validation du trigramme : {}

source: Units successfully validated : {}
fr: Unités validées avec succes : {}

source: Units validation Error
fr: Erreur dans la validation des unités

source: Units validation Error : {}
fr: Erreur dans la validation des unités : {}

source: Coefficients successfully validated : {}
fr: Coefficients validé : {}

source: Coefficients validation Error
fr: Erreur dans la validation des coefficients
